<a href="https://colab.research.google.com/github/rafaelacirino/exercicios/blob/main/DataFrame.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Criando DataFrame

DataFrame são criados a partir de Dicionários e Listas. É uma estrutura de dados bidimensional em formato tabular, ou seja, com linhas e colunas e de vários tipos. 
Aqui vamos abordar como criar um DataFrame utilizando a biblioteca **Pandas**.

In [2]:
#importar biblioteca Pandas
import pandas as pd

# DataFrame a partir de Dicionários

Uma estrutura muito utilizada no *Python* é o dicionário. Dicionário é uma coleção de itens desordenados. Ele é composto de chaves e valores acossiados à essas chaves, chaves são uma espécie de identificador.
É muito conveniente informarmos nossos dados em uma variável do tipo dict, pois sua conversão em DataFrame é muito simples e direta.

In [3]:
#criar dicionário
dados = {
    'nome': ['Carlos', 'Theo', 'Raquel', 'Fernanda'],
    'idade': [35, 32, 15, 49],
    'cidade': ['Araraquara', 'Belém', 'Natal', 'Curitiba'],
    'comprou': [True, False, False, True]
}

O nome do dicionário é dados e as chaves são nome, idade, cidade e comprou. Cada chave tem seus respectivos valores.

In [4]:
#criando o DataFrame
df = pd.DataFrame(dados)

In [5]:
#imprimindo o DataFrame
df

       nome  idade      cidade  comprou
0    Carlos     35  Araraquara     True
1      Theo     32       Belém    False
2    Raquel     15       Natal    False
3  Fernanda     49    Curitiba     True

## Modificar o índice e acessá-lo

Para modificar o valor do índice, seja por números ou strings/letras, é só usar df.index[valores_escolhidos_par_cada_indice] e para acessar o conteúdo ou as informações contidas no respectivo índice, basta df.loc[indice_escolhido]. Vejamos:

In [7]:
#alterar valores do indice
df.index = [10, 11, 12, 13]

In [8]:
df

        nome  idade      cidade  comprou
10    Carlos     35  Araraquara     True
11      Theo     32       Belém    False
12    Raquel     15       Natal    False
13  Fernanda     49    Curitiba     True

In [9]:
#acessar as informações do índice
df.loc[12]

nome       Raquel
idade          15
cidade      Natal
comprou     False
Name: 12, dtype: object

### Criar ou Acrescentar novas colunas

Para acrescentar novas colunas, caso seja necessário, basta usar uma função do Pandas conhecida como *broadcasting*. Basta informar o nome da coluna em colchetes e atribuir um valor que será replicado para todas as linhas.

In [10]:
#criar colunas
df['Saldo'] = 0.0

In [11]:
#mostrando a coluna criada
df

        nome  idade      cidade  comprou  Saldo
10    Carlos     35  Araraquara     True    0.0
11      Theo     32       Belém    False    0.0
12    Raquel     15       Natal    False    0.0
13  Fernanda     49    Curitiba     True    0.0

### Altear o nome de uma coluna

Caso seja necessário a alteração do nome de uma coluna, basta fazê-lo diretamente no atributo da variável.

In [12]:
#alterando o nome de uma coluna
df.columns = ['Name', 'Age', 'City', 'Bought', 'Balance']

In [13]:
#imprimindo as novas colunas
df

        Name  Age        City  Bought  Balance
10    Carlos   35  Araraquara    True      0.0
11      Theo   32       Belém   False      0.0
12    Raquel   15       Natal   False      0.0
13  Fernanda   49    Curitiba    True      0.0